In [1]:
#importing the pandas lib
import pandas as pd

In [2]:
#converting dict into pandas dataframe
import random

In [3]:
import random
random.seed(3) #generate same random numbers every time
names = [ "jess","jordan", "sandy","ted","barney","tyler","rebecca"]
ages = [random.randint(18,35) for x in range( len(names) )]
people = {"names" : names, "ages" : ages}
df = pd.DataFrame.from_dict(people)
print(df)

     names  ages
0     jess    25
1   jordan    35
2    sandy    22
3      ted    29
4   barney    33
5    tyler    20
6  rebecca    18

In [4]:
#selecting a column in pandas
print( df['ages'] )
print( df['ages'][3] )

0    25
1    35
2    22
3    29
4    33
5    20
6    18
Name: ages, dtype: int64
29

In [5]:
print( df["ages"] )

0    25
1    35
2    22
3    29
4    33
5    20
6    18
Name: ages, dtype: int64

In [6]:
print( df["ages"][3] )#select value of ages in the fourth row

29

In [7]:
#selecting a record in pandas using .loc
print( df.loc[0] )

names    jess
ages       25
Name: 0, dtype: object

In [8]:
print( df.loc[0]["names"] ) #selecting value at record 0 in the names column

jess

In [9]:
print( df[2:5] ) # slicing a dataframe to grab certain records

    names  ages
2   sandy    22
3     ted    29
4  barney    33

In [10]:
print( df.head(5) ) #count from top of records

    names  ages
0    jess    25
1  jordan    35
2   sandy    22
3     ted    29
4  barney    33

In [11]:
print (df.tail(3) ) #count from bottom of records

     names  ages
4   barney    33
5    tyler    20
6  rebecca    18

In [12]:
#access the column headers 
headers = df.keys()
print(headers)

Index(['names', 'ages'], dtype='object')

In [13]:
#shape determines number of records and columns
print( df.shape )

(7, 2)

In [1]:
df.describe()

NameError: name 'df' is not defined

In [2]:
print ( df.describe )

NameError: name 'df' is not defined

In [3]:
print(df)

NameError: name 'df' is not defined

In [4]:
import random
random.seed(3) #generate same random numbers every time
names = [ "jess","jordan", "sandy","ted","barney","tyler","rebecca"]
ages = [random.randint(18,35) for x in range( len(names) )]
people = {"names" : names, "ages" : ages}
df = pd.DataFrame.from_dict(people)
print(df)

NameError: name 'pd' is not defined

In [5]:
import pandas as pd
import random

random.seed(3) #generate same random numbers every time
names = [ "jess","jordan", "sandy","ted","barney","tyler","rebecca"]
ages = [random.randint(18,35) for x in range( len(names) )]
people = {"names" : names, "ages" : ages}
df = pd.DataFrame.from_dict(people)
print(df)

     names  ages
0     jess    25
1   jordan    35
2    sandy    22
3      ted    29
4   barney    33
5    tyler    20
6  rebecca    18

In [6]:
print( df.describe )

<bound method NDFrame.describe of      names  ages
0     jess    25
1   jordan    35
2    sandy    22
3      ted    29
4   barney    33
5    tyler    20
6  rebecca    18>

In [7]:
df.describe() #gives max, min, mean.

            ages
count   7.000000
mean   26.000000
std     6.531973
min    18.000000
25%    21.000000
50%    25.000000
75%    31.000000
max    35.000000

In [8]:
#sort based on given column, but keep dataframe in tact using sort_values()
sort_values()
df = df.sort_values("ages")
df.head(5)

NameError: name 'sort_values' is not defined

In [9]:
df.sort_values("ages")
df.head(5)

    names  ages
0    jess    25
1  jordan    35
2   sandy    22
3     ted    29
4  barney    33

In [10]:
sort_values()

NameError: name 'sort_values' is not defined

In [11]:
df.sort_values("ages")

     names  ages
6  rebecca    18
5    tyler    20
2    sandy    22
0     jess    25
3      ted    29
4   barney    33
1   jordan    35

In [12]:
df.head(5)

    names  ages
0    jess    25
1  jordan    35
2   sandy    22
3     ted    29
4  barney    33

In [13]:
#conditionals
can_drink = df["ages"] > 21
print(can_drink)

0     True
1     True
2     True
3     True
4     True
5    False
6    False
Name: ages, dtype: bool

In [14]:
df[ df["ages"] > 21 ]

    names  ages
0    jess    25
1  jordan    35
2   sandy    22
3     ted    29
4  barney    33

In [15]:
#generate new column with data for dataframe (fake data)
random.seed(321)
tenure = [ random.randint(0, 10) for x in range( len(df) )]
#adding new key-value pair in a dict 
df["tenure"] = tenure
df.head()

    names  ages  tenure
0    jess    25       4
1  jordan    35       6
2   sandy    22       2
3     ted    29       5
4  barney    33       8

In [16]:
#defining new column  with applied conditions
def ageGroup(age):
    return "Teenager" if age < 21 else "Adult"
df["age_group"] = df["ages"].apply(ageGroup)
df.head(10)

     names  ages  tenure age_group
0     jess    25       4     Adult
1   jordan    35       6     Adult
2    sandy    22       2     Adult
3      ted    29       5     Adult
4   barney    33       8     Adult
5    tyler    20       7  Teenager
6  rebecca    18       5  Teenager

In [17]:
def.groupby("age_group", as_index=False).count().head()

SyntaxError: invalid syntax (2941449627.py, line 1)

In [18]:
df.groupby("age_group", as_index=False).count().head()

  age_group  names  ages  tenure
0     Adult      5     5       5
1  Teenager      2     2       2

In [19]:
#group data on averages of all columns
df.groupby("age_group", as_index=False).mean().head()

  age_group  ages  tenure
0     Adult  28.8     5.0
1  Teenager  19.0     6.0

In [20]:
#group by multiple columns by age group then their tenure
df.groupby( ["age_group", "tenure" ], as_index=False).count().head(10)

  age_group  tenure  names  ages
0     Adult       2      1     1
1     Adult       4      1     1
2     Adult       5      1     1
3     Adult       6      1     1
4     Adult       8      1     1
5  Teenager       5      1     1
6  Teenager       7      1     1

In [21]:
#adding a record to bottom of dataframe 
df.loc[7] = [ 25, "Jess", 2, "Adult" ]
df.head(10)

     names  ages  tenure age_group
0     jess    25       4     Adult
1   jordan    35       6     Adult
2    sandy    22       2     Adult
3      ted    29       5     Adult
4   barney    33       8     Adult
5    tyler    20       7  Teenager
6  rebecca    18       5  Teenager
7       25  Jess       2     Adult

In [22]:
df.loc[7] = [ "Jess", 25, 2, "Adult"]
df.head(10)

     names ages  tenure age_group
0     jess   25       4     Adult
1   jordan   35       6     Adult
2    sandy   22       2     Adult
3      ted   29       5     Adult
4   barney   33       8     Adult
5    tyler   20       7  Teenager
6  rebecca   18       5  Teenager
7     Jess   25       2     Adult

In [23]:
df.loc[7] = [ "jess", 25, 2, "Adult"]
df.head(10)

     names ages  tenure age_group
0     jess   25       4     Adult
1   jordan   35       6     Adult
2    sandy   22       2     Adult
3      ted   29       5     Adult
4   barney   33       8     Adult
5    tyler   20       7  Teenager
6  rebecca   18       5  Teenager
7     jess   25       2     Adult

In [24]:
#remove duplicates based on names
df = df.drop_duplicates( subset="names" )
df.head(10)

     names ages  tenure age_group
0     jess   25       4     Adult
1   jordan   35       6     Adult
2    sandy   22       2     Adult
3      ted   29       5     Adult
4   barney   33       8     Adult
5    tyler   20       7  Teenager
6  rebecca   18       5  Teenager

In [38]:
#test dataframe to join
ratings = { 
    "names" : ["jess", "tyler", "ted"],
    "ratings" : [10, 9, 6]
}
ratings = df.from_dict(ratings)
ratings.head()

   names  ratings
0   jess       10
1  tyler        9
2    ted        6

In [39]:
#perform inner-join based on names
matched_ratings = df.merge(ratings, on="names", how="inner")
matched_ratings.head()

   names ages  tenure age_group  ratings
0   jess   25       4     Adult       10
1    ted   29       5     Adult        6
2  tyler   20       7  Teenager        9

In [28]:
print(df.ratings)

AttributeError: 'DataFrame' object has no attribute 'ratings'

In [29]:
df.ratings

AttributeError: 'DataFrame' object has no attribute 'ratings'

In [30]:
df.ratings()

AttributeError: 'DataFrame' object has no attribute 'ratings'

In [31]:
ratings.loc[1] = [ "jess", 10]

In [32]:
ratings.head()

  names  ages
0  Jess    10
1  jess    10
2   Ted     6

In [33]:
ratings.loc[0] = [ 'jess', 10]
ratings.loc[1] = [ 'tyler', 9]
ratings.loc[2] = [ 'ted', 6]

In [40]:
ratings.head()

   names  ratings
0   jess       10
1  tyler        9
2    ted        6

In [42]:
#performing join on outer *adds column from new dataset onto existing dataset
all_ratings = df.merge( ratings, on="names", how="outer")
all_ratings.head()

    names ages  tenure age_group  ratings
0    jess   25       4     Adult     10.0
1  jordan   35       6     Adult      NaN
2   sandy   22       2     Adult      NaN
3     ted   29       5     Adult      6.0
4  barney   33       8     Adult      NaN